In [1]:
#pandas built on numpy, ana upgradation of numpy
#any data srucutre on large scale while numpy only for limited data types
import pandas as pd

In [6]:
data = pd.read_csv('Salary.csv')

In [7]:
data.head()

      Name  Salary  YearsExperience
0  Tanishq   123.0              1.7
1       df     2.0              4.5
2       rg     4.0              5.0
3        r     2.0             22.3
4        g   434.0              0.5

In [8]:
data.tail()

   Name   Salary  YearsExperience
14    g     46.0            2.343
15  erg    346.0            2.000
16    g      4.0            2.000
17  erg     25.0            4.000
18  sdf  22344.0            0.700

In [9]:
data['YearsExperience'].max()

22.3

In [10]:
data['YearsExperience'].mean()

5.045947368421053

In [11]:
data['Salary'].min()

2.0

In [12]:
data['Salary'].max()

22344.0

In [13]:
data.shape

(19, 3)